#### PolymeshTopology Members

---

|  |
| --- |
| PolymeshTopology Class   Methods   Properties   See Also |

The  PolymeshTopology  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PolymeshTopology |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFacet | Returns a definition of one facet |
| Public method | GetFacets | Returns a definitions of all facets of the polymesh |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetNormal | Returns a normal vector at the given index |
| Public method | GetNormals | Returns all normals assigned to the polymesh |
| Public method | GetPoint | Returns one point at the given index. |
| Public method | GetPoints | Returns all points of the polymesh. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetUV | Returns one UV coordinate at the given index. |
| Public method | GetUVs | Returns all UV coordinates assigned to the polymesh |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DistributionOfNormals | Indicates the distribution of normal vectors along the tessellated polymesh surface. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | NumberOfFacets | The number of facet in the polymesh. |
| Public property | NumberOfNormals | The number of normals associated with the polymesh |
| Public property | NumberOfPoints | The number of points in the polymesh |
| Public property | NumberOfUVs | The number of UV coordinates available for the polymesh. |

# See Also

PolymeshTopology Class

Autodesk.Revit.DB Namespace